//Задание 9: Массив Стран
//Создайте многомерный массив, где в первом массиве хранится названия каких-либо стран, в следующем столицы данных стран и в последнем массиве используемая денежная единица. Сохраните информацию минимум по 3 странам и выведите в консоль в виде:
//Страна          Столица        Валюта

fun main(args: Array<String>) {
    val countries = arrayOf("Абхазия", "Австралия", "Австрия", "Азербайджан", "Албания")
    val capitals = arrayOf("Сухум", "Канберра", "Вена", "Баку", "Тирана")
    val currency = arrayOf("Российский рубль", "Австралийский доллар", "Евро", "Азербайджанский манат", "Албанский лек")

    val table = arrayOf(countries, capitals, currency)

    for (i in 0 until table[0].size) {
        for (j in 0 until table.size) {
            print(String.format("%-15s", table[j][i]))
        }
        println()
    }
}